{"AGONDA BEACH": "Agonda beach in South Goa is a must visit. 39.2 kilometers from Margao, this is an isolated stretch of sand lined by palm groves. It is a very quiet, peaceful, and picturesque beach with few tourists. There is a turtle center in the north, and rocky outcrops in the south. Developed tourist infrastructure! You will find many shops, cafes, beach shacks, bars, restaurants, yoga centers and massage parlors. But you will still get a less “touristic feel” here. Agonda has been ranked as “Asia’s #1 beach for 2018” according to the TripAdvisor Travelers’ Choice® awards. It was ranked Asia’s 4th best beach in 2016 as well.", "FORT AGUADA": "Fort Aguada is an old 17th century Portuguese fort in north Goa. It is at the confluence of the Mandovi River and the Arabian Sea on top of a hill. The Portuguese constructed this fort as a defense against the Marathas and the Dutch. There is a deep dry moat here and a 13 meter high lighthouse, which was constructed in 1864. Many buildings within the fort are still in very good condition. From Aguada, you can get awesome views of the shoreline, the Arabian Sea, Mandovi River, and even the city of Panaji, which is on the other side of the river.", "CHAPORA FORT": "The Chapora fort is in North Goa, close to Vagator beach. The Chapora River meets the Arabian Sea here. Chapora fort is a must-visit for those who love Bollywood Hindi movies. The famous Bollywood movie “Dil Chahta Hai” was filmed here. The fort is almost in ruins now, but it still offers incredible views of the river and the coastline. Take a picture – there are many photo opportunities here! Distance from Panaji – 21.7 kilometers by the NH66.", "DUDHSAGAR FALLS": "Witness the fury of nature, in what is one of India’s tallest and most powerful waterfalls. Dudhsagar Falls is 47 kilometers from Margao by the MDR52. It is located on the Goa-Karnataka border. Dudhsagar Falls looks most impressive in the monsoon when there is a lot of water. It cascades down for 1017 feet from a steep mountain face. You can view the falls from a train journey to and from Margao, or you can trek to the base of the falls. You have to trek through the Bhagwan Mahaveer Sanctuary and Mollem National Park. There are many viewpoints along the way.", "BAGA BEACH": "Baga beach in North Goa is one of Goa’s most popular beaches. The Baga River is in the north. Calangute beach, also popular, is in the south. The Baga-Calangute stretch is one of the longest sandy shores in Goa. You will find many beach shacks, pubs, restaurants, shops, nightclubs and water sports activities, including banana riding, speed boats, paddle boarding, paragliding, surf boarding, and more. Britto’s at the northern end of the beach is a famous shack. Club Tito’s and Cafe Mambo are two famous Goa nightclubs, both in Baga.", "ANJUNA WEDNESDAY MARKET": "Started by hippies in the 1960s, the Anjuna flea market is a landmark in Goa. It is at the southern end of the Anjuna beach. The Anjuna flea market is open on Wednesdays between 9 AM and 6 PM. There are more than 500 stalls selling handicrafts, handmade jewelry, Kashmiri and Tibetan goods, bags, clothing, tribal artifacts, and more. There are food stalls, bands playing jazz and rock music.", "ASILICA OF BOM JESUS": "The body of St. Francis Xavier is kept preserved at the Bom Jesus Basilica in Goa. It is one of the most important tourist attractions in Goa, and a landmark for Catholics from around the world. The Basilica of Bom Jesus is an UNESCO World Heritage site. The Church was constructed in baroque style in 1605. The Saint’s body was brought here in 1622, and it has since then been laid in a glass mausoleum. There is also a gallery of Modern Art in the Basilica. Timings: 9.00 am — 6.30 pm. Distance from Panaji – 12 kilometers by the NH748.", "HALASSA RESTAURANT": "The Thalassa restaurant is in Vagator, North Goa. It serves the best Greek and Mediterranean food in Goa. Good décor and awesome views of the Arabian Sea! Good music in the evening. The meat platter, mock tails, baklava, vegetable moussaka, mushroom saganaki, chocolate cake, and the chocolate cheesecake are some of the favorites here. Their seafood, including prawns, and calamari are also legendary. See the sunset with a drink if you are in North Goa. You may want to stay back till dinner.", "APUSA MARKET": "The Mapusa Market is 10.3 kilometers by road from the Anjuna Beach in North Goa. Open on Fridays, this is one of the biggest, most colorful and interesting markets in Goa. People from the villages and far-off places come here to sell their produce. You will find a wide variety of fish, meat, and vegetables, fresh spices, fruits, flowers, nuts, home-made chouriço, marinated pork sausages, pickles, ropes, coir mats, jewelry, clothes, and even wines. The stores are grouped together by the type of products sold.", "CHURCH OF OUR LADY OF IMMACULATE CONCEPTION": "Also called the “Immaculate Conception Church”, this beautiful church is in Goa’s capital Panaji, close to the Mandovi Bridge. It used to be a chapel in 1541. The larger church building came up only in 1619. Since then, many revisions and improvements have been carried out, but the original building remains. Devotees have been coming here for a long time. Old Portuguese sailors offered their prayers, asking for a good voyage. They returned after the trip to say thank you. There is a feast every year on December 8th, which many locals and tourists attend. Timings: 10 am — 12.30 pm, 3 — 5.30 pm", "LATIN QUARTER": "The Fontainhas neighborhood in Panjim is Goa’s Old Latin Quarter, a UNESCO Heritage Zone. Explore the narrow winding lanes and streets, see the old buildings, quaint shops, bakeries, restaurants, and art galleries. Don’t miss the Portuguese mansions here. Watch out for the red tiled roofs and the projecting balconies. They have a distinct Mediterranean feel. You can also take the heritage walk of the Fontainhas area.", "NAVAL AVIATION MUSEUM": "The Naval Aviation Museum is at Dabolim in Vasco da Gama, just behind the international airport. This is the only Naval Aviation Museum in India and unique in Asia. There is both an indoor and outdoor section with exhibits that include bombs, rockets, aircrafts, parachutes, protective gears, armaments, outfits of pilots and much more.", "CASINO IN PANJIM": "Casino gaming is big in Goa. In Goa, you will find both land-based and off-shore casinos, on ships. Many casinos are located just off Panjim, on the Mandovi River. Famous casinos in Goa are Deltin Royale, Casino Paradise, Deltin Jaqk, Casino Carnival, Casino Pearl, Casino Pride, and Casino Paradise. There is live music, dancing, and entertainment shows, apart from the usual games – Indian Flush, poker, black jack, and baccarat.", "GRANDE ISLAND": "Grande Island or Ilha Grande is in the Arabian Sea, off the coast of Vasco da Gama. There are ferry services from the mainland. You can do scuba diving, reef diving, snorkeling, swimming, fishing, and dolphin watching. There are many water sports activities to enjoy. It’s a great place for both beginner and advanced divers and snorkelers. You can explore ship wrecks, including the Suzy wreck, the Davy Jones Locker, Turbo Tunnel, Bounty Rock, and the Serge City. Professional instructors are available. There are banana boat and bumper boat rides too. Just carry your swimming and beach essentials. You can also go on a daylong fishing trip from 8 in the morning to 4 in the afternoon, and finish off with a barbecue.", "GO KART RACING": "Go karting is great fun. The sport is becoming very popular in India. There are two tracks in Goa, at Nuvem in South Goa, and Arpora in North Goa. The Nuvem track is the largest in India. The 482 meters track is on a hill, just behind the Tata Motors Showroom. There are many turns here, some more complicated than others, which the skilled drivers will especially love. There is a huge bulletin board that displays the racing data. The Nuvem track is open from Tuesday to Sunday, 4 p.m. to 10 p.m. The North Goa track at Arpora is shorter, and has fewer turns.", "PARAGLIDING IN ARAMBOL": "Arambol in North Goa is a good place for paragliding. Take off from a rocky headland and get an amazing view from the top. You have to trek to the top of the headland. Your pilot will then give you brief instructions and explain the safety precautions. Fly sky high over Arambol and see the shoreline from the top, the sea, and the interiors. It will be a memorable experience.", "HILL TOP CLUB IN ANJUNA": "The Hilltop Nightclub in North Goa is between Ozran Beach and Anjuna on the top of a hill. This is one of the best places in Goa for trance music and rave parties. There is a big area for people to drink and dance. The outside is lit up with pretty lights. There is a swimming pool too. Thousands attend rave parties during weekends in the peak season. The DJs are from England, Sweden, Italy, France, Russia, Germany, Israel, and India.", "ARAMBOL HIPPIE FESTIVAL": "Arambol in North Goa was popular with the hippies. They are long gone, but you will still find the hippie spirit here. You can hear the songs and stories of their times. You can feel the free spirit. Music brings a whiff of fresh air at the Drum Circles in Arambol, where the locals and tourists come together to enjoy music, dancing, and drumming to remember the days of the hippies.", "FORT CABO DE RAMA": "The Cabo de Rama Fort is in South Goa, 17.2 kilometers from Agonda Beach. This old fort has been held by the Portuguese, Hindu, and Muslim monarchs at various times. There was a chapel and commandant quarters within the fort during the Portuguese days. There was also a military barrack here. It was turned into a prison for a short time after the Portuguese left. Now it is in ruins, but is still a popular tourist spot. You will get very good views of the sea and the surrounding landscape from the top. The Cabo de Rama Fort is a great place to see sunsets.", "TEREKHOL FORT": "The Terekhol or Tiracol Fort is in extreme North Goa, on the northern side of the Terekhol River. It is actually in the neighboring state of Maharashtra, as the state lines pass through the middle of the river. But many tourists from North Goa visit the fort. There is a ferry service from Querim. It was constructed in the 17th century by Maharaja Khem Sawant Bhonsle, a Marathi ruler. The fort sits on a hill and gives a commanding view of the river and the sea. There was a barrack and 12 guns here, but the fort still fell to the Portuguese. They extensively revamped Terekhol in 1764 and held it for strategic maritime defense till 1961 when Goa became a part of India."}